Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1160/periph/PERI_FLEXSPI.h
#define FLEXSPI_AHBBUFREGIONEND1_end_address_MASK (0xFFFFF000U)
#define FLEXSPI_AHBBUFREGIONEND1_end_address_SHIFT (12U)
/*! end_address - End address of region 1. Minimal 4K Bytes aligned. It is system address. */
#define FLEXSPI_AHBBUFREGIONEND1_end_address(x)  (((uint32_t)(((uint32_t)(x)) << FLEXSPI_AHBBUFREGIONEND1_end_address_SHIFT)) & FLEXSPI_AHBBUFREGIONEND1_end_address_MASK)
/*! @} */

/*! @name AHBBUFREGIONSTART2 - RX BUF Start address of region 2 */
/*! @{ */

#define FLEXSPI_AHBBUFREGIONSTART2_start_address_MASK (0xFFFFF000U)
#define FLEXSPI_AHBBUFREGIONSTART2_start_address_SHIFT (12U)
/*! start_address - Start address of region 2. Minimal 4K Bytes aligned. It is system address. */
#define FLEXSPI_AHBBUFREGIONSTART2_start_address(x) (((uint32_t)(((uint32_t)(x)) << FLEXSPI_AHBBUFREGIONSTART2_start_address_SHIFT)) & FLEXSPI_AHBBUFREGIONSTART2_start_address_MASK)
/*! @} */

/*! @name AHBBUFREGIONEND2 - RX BUF region End address of region 2 */
/*! @{ */

#define FLEXSPI_AHBBUFREGIONEND2_end_address_MASK (0xFFFFF000U)
#define FLEXSPI_AHBBUFREGIONEND2_end_address_SHIFT (12U)
/*! end_address - End address of region 2. Minimal 4K Bytes aligned. It is system address. */
#define FLEXSPI_AHBBUFREGIONEND2_end_address(x)  (((uint32_t)(((uint32_t)(x)) << FLEXSPI_AHBBUFREGIONEND2_end_address_SHIFT)) & FLEXSPI_AHBBUFREGIONEND2_end_address_MASK)
/*! @} */

/*! @name AHBBUFREGIONSTART3 - RX BUF Start address of region 3 */
/*! @{ */

#define FLEXSPI_AHBBUFREGIONSTART3_start_address_MASK (0xFFFFF000U)
#define FLEXSPI_AHBBUFREGIONSTART3_start_address_SHIFT (12U)
/*! start_address - Start address of region 3. Minimal 4K Bytes aligned. It is system address. */
#define FLEXSPI_AHBBUFREGIONSTART3_start_address(x) (((uint32_t)(((uint32_t)(x)) << FLEXSPI_AHBBUFREGIONSTART3_start_address_SHIFT)) & FLEXSPI_AHBBUFREGIONSTART3_start_address_MASK)
/*! @} */

/*! @name AHBBUFREGIONEND3 - RX BUF region End address of region 3 */
/*! @{ */

#define FLEXSPI_AHBBUFREGIONEND3_end_address_MASK (0xFFFFF000U)
#define FLEXSPI_AHBBUFREGIONEND3_end_address_SHIFT (12U)
/*! end_address - End address of region 3. Minimal 4K Bytes aligned. It is system address. */
#define FLEXSPI_AHBBUFREGIONEND3_end_address(x)  (((uint32_t)(((uint32_t)(x)) << FLEXSPI_AHBBUFREGIONEND3_end_address_SHIFT)) & FLEXSPI_AHBBUFREGIONEND3_end_address_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group FLEXSPI_Register_Masks */


/*!
 * @}
 */ /* end of group FLEXSPI_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__CWCC__)
  #pragma pop
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_FLEXSPI_H_ */

